---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeSurfaceWarn
source: html/116b3336-d2df-1531-0757-36d5d84822db.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeSurfaceWarn Property

Can't construct surface.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMakeSurfaceWarn { get; }
```